1.83.0 doesnt fix the issue, it still wants to replace the api key

```
  # module.confluent-environment.data.confluent_schema_registry_cluster.schema_registry_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "confluent_schema_registry_cluster" "schema_registry_cluster" {
      + api_version   = (known after apply)
      + display_name  = (known after apply)
      + id            = (known after apply)
      + kind          = (known after apply)
      + package       = (known after apply)
      + region        = (known after apply)
      + resource_name = (known after apply)
      + rest_endpoint = (known after apply)

      + environment {
          + id = "t27797"
        }
    }

  # module.confluent-environment.confluent_api_key.schema_registry must be replaced
-/+ resource "confluent_api_key" "schema_registry" {
      ~ id                     = "4TCAK7PBN32UNYQ4" -> (known after apply)
      ~ secret                 = (sensitive value)
        # (3 unchanged attributes hidden)

      ~ managed_resource {
          ~ api_version = "srcm/v2" # forces replacement -> (known after apply) # forces replacement
          ~ id          = "lsrc-m8kz1" # forces replacement -> (known after apply) # forces replacement
          ~ kind        = "Cluster" # forces replacement -> (known after apply) # forces replacement

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }
```

based on that, it doesnt look like hardoding only api version will fix it, since those 3 lines are forcing a replacement, and they are based on a data that is not on the state now (the resource was)